---
kind: enumMember
id: F:Autodesk.Revit.DB.DistributionOfNormals.AtEachPoint
enum: Autodesk.Revit.DB.DistributionOfNormals
source: html/8e00e7aa-b39b-51b4-26e4-0f5c1404df32.htm
---
# Autodesk.Revit.DB.DistributionOfNormals.AtEachPoint

One normal vector is assigned to each vertex of the polymesh.